test.xml



<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://fedex.com/ws/ship/v17">
    <SOAP-ENV:Body>
        <ns1:ProcessShipmentRequest>
            <ns1:WebAuthenticationDetail>
                <ns1:ParentCredential>
                    <ns1:Key>qH03pL4OlLrk0Kqv</ns1:Key>
                    <ns1:Password>CECKrJgP97EXUAkmmOfoFztkc</ns1:Password>
                </ns1:ParentCredential>
                <ns1:UserCredential>
                    <ns1:Key>qH03pL4OlLrk0Kqv</ns1:Key>
                    <ns1:Password>CECKrJgP97EXUAkmmOfoFztkc</ns1:Password>
                </ns1:UserCredential>
            </ns1:WebAuthenticationDetail>
            <ns1:ClientDetail>
                <ns1:AccountNumber>510087100</ns1:AccountNumber>
                <ns1:MeterNumber>100281503</ns1:MeterNumber>
            </ns1:ClientDetail>
            <ns1:TransactionDetail>
                <ns1:CustomerTransactionId>*** Express Domestic Shipping Request using PHP ***</ns1:CustomerTransactionId>
            </ns1:TransactionDetail>
            <ns1:Version>
                <ns1:ServiceId>ship</ns1:ServiceId>
                <ns1:Major>17</ns1:Major>
                <ns1:Intermediate>0</ns1:Intermediate>
                <ns1:Minor>0</ns1:Minor>
            </ns1:Version>
            <ns1:RequestedShipment>
                <ns1:ShipTimestamp>2017-06-27T16:54:09+02:00</ns1:ShipTimestamp>
                <ns1:DropoffType>REGULAR_PICKUP</ns1:DropoffType>
                <ns1:ServiceType>PRIORITY_OVERNIGHT</ns1:ServiceType>
                <ns1:PackagingType>YOUR_PACKAGING</ns1:PackagingType>
                <ns1:TotalWeight>
                    <ns1:Units>KG</ns1:Units>
                    <ns1:Value>0.5</ns1:Value>
                </ns1:TotalWeight>
                <ns1:Shipper>
                    <ns1:Contact>
                        <ns1:PersonName>Santy</ns1:PersonName>
                        <ns1:CompanyName>rShipper</ns1:CompanyName>
                        <ns1:PhoneNumber>9876543210</ns1:PhoneNumber>
                    </ns1:Contact>
                    <ns1:Address>
                        <ns1:StreetLines>dszvd cxvdxvdfxc</ns1:StreetLines>
                        <ns1:City>Kota</ns1:City>
                        <ns1:StateOrProvinceCode>DEL</ns1:StateOrProvinceCode>
                        <ns1:PostalCode>324001</ns1:PostalCode>
                        <ns1:CountryCode>IN</ns1:CountryCode>
                    </ns1:Address>
                </ns1:Shipper>
                <ns1:Recipient>
                    <ns1:Contact>
                        <ns1:PersonName>Pandey</ns1:PersonName>
                        <ns1:CompanyName>Shipper</ns1:CompanyName>
                        <ns1:PhoneNumber>9876543210</ns1:PhoneNumber>
                    </ns1:Contact>
                    <ns1:Address>
                        <ns1:StreetLines>fdg gfdgfd fdgdfg gbfgbf</ns1:StreetLines>
                        <ns1:City>Mumbai</ns1:City>
                        <ns1:StateOrProvinceCode>BOM</ns1:StateOrProvinceCode>
                        <ns1:PostalCode>400069</ns1:PostalCode>
                        <ns1:CountryCode>IN</ns1:CountryCode>
                        <ns1:Residential>true</ns1:Residential>
                    </ns1:Address>
                </ns1:Recipient>
                <ns1:ShippingChargesPayment>
                    <ns1:PaymentType>SENDER</ns1:PaymentType>
                    <ns1:Payor>
                        <ns1:ResponsibleParty>
                            <ns1:AccountNumber>510087100</ns1:AccountNumber>
                            <ns1:Address>
                                <ns1:CountryCode>IN</ns1:CountryCode>
                            </ns1:Address>
                        </ns1:ResponsibleParty>
                    </ns1:Payor>
                </ns1:ShippingChargesPayment>
                <ns1:CustomsClearanceDetail>
                    <ns1:DutiesPayment>
                        <ns1:PaymentType>SENDER</ns1:PaymentType>
                        <ns1:Payor>
                            <ns1:ResponsibleParty>
                                <ns1:AccountNumber>510087100</ns1:AccountNumber>
                                <ns1:Address>
                                    <ns1:CountryCode>IN</ns1:CountryCode>
                                </ns1:Address>
                            </ns1:ResponsibleParty>
                        </ns1:Payor>
                    </ns1:DutiesPayment>
                    <ns1:DocumentContent>NON_DOCUMENTS</ns1:DocumentContent>
                    <ns1:CustomsValue>
                        <ns1:Currency>INR</ns1:Currency>
                        <ns1:Amount>1000</ns1:Amount>
                    </ns1:CustomsValue>
                    <ns1:CommercialInvoice>
                        <ns1:Purpose>REPAIR_AND_RETURN</ns1:Purpose>
                    </ns1:CommercialInvoice>
                    <ns1:Commodities>
                        <ns1:NumberOfPieces>1</ns1:NumberOfPieces>
                        <ns1:Description>Books &amp; Pen</ns1:Description>
                        <ns1:CountryOfManufacture>IN</ns1:CountryOfManufacture>
                        <ns1:Weight>
                            <ns1:Units>KG</ns1:Units>
                            <ns1:Value>0.5</ns1:Value>
                        </ns1:Weight>
                        <ns1:Quantity>1</ns1:Quantity>
                        <ns1:QuantityUnits>EA</ns1:QuantityUnits>
                        <ns1:UnitPrice>
                            <ns1:Currency>INR</ns1:Currency>
                            <ns1:Amount>1000</ns1:Amount>
                        </ns1:UnitPrice>
                        <ns1:CustomsValue>
                            <ns1:Currency>INR</ns1:Currency>
                            <ns1:Amount>1000</ns1:Amount>
                        </ns1:CustomsValue>
                    </ns1:Commodities>
                </ns1:CustomsClearanceDetail>
                <ns1:LabelSpecification>
                    <ns1:LabelFormatType>COMMON2D</ns1:LabelFormatType>
                    <ns1:ImageType>PDF</ns1:ImageType>
                    <ns1:LabelStockType>PAPER_7X4.75</ns1:LabelStockType>
                </ns1:LabelSpecification>
                <ns1:ShippingDocumentSpecification>
                    <ns1:ShippingDocumentTypes>PRO_FORMA_INVOICE</ns1:ShippingDocumentTypes>
                    <ns1:CommercialInvoiceDetail />
                </ns1:ShippingDocumentSpecification>
                <ns1:PackageCount>1</ns1:PackageCount>
                <ns1:RequestedPackageLineItems>
                    <ns1:SequenceNumber>1</ns1:SequenceNumber>
                    <ns1:GroupPackageCount>1</ns1:GroupPackageCount>
                    <ns1:Weight>
                        <ns1:Units>KG</ns1:Units>
                        <ns1:Value>0.5</ns1:Value>
                    </ns1:Weight>
                    <ns1:Dimensions>
                        <ns1:Length>1</ns1:Length>
                        <ns1:Width>1</ns1:Width>
                        <ns1:Height>1</ns1:Height>
                        <ns1:Units>CM</ns1:Units>
                    </ns1:Dimensions>
                </ns1:RequestedPackageLineItems>
            </ns1:RequestedShipment>
        </ns1:ProcessShipmentRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

